Revit 2027 API
BuiltInFailures.ViewFailures.NoTargetsForDependentViewPropagation Property
 There are no valid views. Only views without dependents can be used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoTargetsForDependentViewPropagation { get; }
Public Shared ReadOnly Property NoTargetsForDependentViewPropagation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoTargetsForDependentViewPropagation {
	FailureDefinitionId^ get ();
}
static member NoTargetsForDependentViewPropagation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace